False - ложь.

True - правда.

None - "пустой" объект.

and - логическое И.

with / as - менеджер контекста.

assert условие - возбуждает исключение, если условие ложно.

break - выход из цикла.

class - пользовательский тип, состоящий из методов и атрибутов.

continue - переход на следующую итерацию цикла.

def - определение функции.

del - удаление объекта.

elif - в противном случае, если.

else - см. for/else или if/else.

except - перехватить исключение.

finally - вкупе с инструкцией try, выполняет инструкции независимо от того, было ли исключение или нет.

for - цикл for.

from - импорт нескольких функций из модуля.

global - позволяет сделать значение переменной, присвоенное ей внутри функции, доступным и за пределами этой функции.

if - если.

import - импорт модуля.

in - проверка на вхождение.

is - ссылаются ли 2 объекта на одно и то же место в памяти.

lambda - определение анонимной функции.

nonlocal - позволяет сделать значение переменной, присвоенное ей внутри функции, доступным в объемлющей инструкции.

not - логическое НЕ.

or - логическое ИЛИ.

pass - ничего не делающая конструкция.

raise - возбудить исключение.

return - вернуть результат.

try - выполнить инструкции, перехватывая исключения.

while - цикл while.

yield - определение функции-генератора.

Модуль keyword
В общем-то, keyword - не такой уж и модуль, но все же.

keyword.kwlist - список всех доступных ключевых слов.

keyword.iskeyword(строка) - является ли строка ключевым словом.