<?php 

    // null
    // array       5.1 Массив. По умолчанию может быть null -значением или массивом
    // int         7.0 Целое значение. По умолчанию может быть null или целым значением 
    // float       7.0 Числовое значение с плавающей (десятичной) точкой. Допускается целое значение, даже если включен строгий режим. По умолчанию может быть null, целым или числовым значением с плавающей точкой
    // callable    5.4 Вызываемый код ( например, анонимная функция). По умолчанию может быть null
    // bool        7.0 Логическое значение. По умолчанию может быть null или логическим значением
    // string      5.0 Символьные данные. По умолчанию может быть null или строковым значением
    // self        5.0 Ссылка на содержащий класс [тип класса] 5.0 Тип класса или интерфейса. По умолчанию может быть null
    // iterable    7.1 Может быть обойден с использованием цикла foreach ( необязательно массив)
    // object      7.2 Объект
    // mixed       8.0 Явное указание, что значение может быть любого типа
    // union       int|float|string
    // never       прекратит работу без возврата значения либо вызывает конструкцию языка exit()
    // void        функция никогда не возвращает значение

?>